"""

Домашнее задание №1

Условный оператор: Сравнение строк

* Написать функцию, которая принимает на вход две строки
* Проверить, является ли то, что передано функции, строками. 
  Если нет - вернуть 0
* Если строки одинаковые, вернуть 1
* Если строки разные и первая длиннее, вернуть 2
* Если строки разные и вторая строка 'learn', возвращает 3
* Вызвать функцию несколько раз, передавая ей разные праметры 
  и выводя на экран результаты

"""

def main():
    """
    Эта функция вызывается автоматически при запуске скрипта в консоли
    В ней надо заменить pass на ваш код
    """
    str1 = 'learn'
    str2 = 'python'
    # if type(str1 and str2) == str:
    #   return "good"  
    # elif type(str1 and str2) != str: 
    #   return "0"
    # if str1 == str2:
    #   return "1"
    # else:
    #   return "very"
    # if str1 != str2 and len(str1)>len(str2):
    #   return "2"
    # else:
    #   return "over"
    # if str1 != str2 and str2 == "learn":
    #   return "3"
    # else:
    #   return "vau"

print (main())

    
if __name__ == "__main__":
    main()
